src/Documents/ПеремещениеТовара/ПеремещениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТовара</name>
  <registerRecords>InformationRegister.СостояниеНоменклатуры</registerRecords>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/СостояниеНоменклатуры/СостояниеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеНоменклатуры</name>
  <comment>Описывает все возможные состояния номенклатуры</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЭксплуатации</name>
    <comment>Пустая ссылка - все нормально, иначе см. основание</comment>
    <type>
      <types>EnumRef.ОснованияВыводаТовараИзЭксплуатации</types>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПеремещениеТовара/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Срез = РегистрыСведений.СостояниеНоменклатуры.СрезПоследних(Дата,
		Новый Структура(Метаданные.РегистрыСведений.СостояниеНоменклатуры.Измерения.Товар.Имя, Товар));
	Движения.СостояниеНоменклатуры.Записывать = Истина;
	Движение = Движения.СостояниеНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Станция = Станция;
	Если Срез.Количество() > 0 Тогда
		Движение.Арендатор = Срез[0].Арендатор;
		Движение.СостояниеЭксплуатации = Срез[0].СостояниеЭксплуатации;
	КонецЕсли;
КонецПроцедуры
